#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-route-53.aws_route53_record.notebook-shunkakinoki-com-CNAME will be created
  + resource "aws_route53_record" "notebook-shunkakinoki-com-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "notebook.shunkakinoki.com"
      + records         = [
          + "shunkakinoki.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_record.shunblog-org-A will be created
  + resource "aws_route53_record" "shunblog-org-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunblog.org"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = "d3px2pbdmvukje.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.aws-route-53.aws_route53_record.shunblog-org-NS will be created
  + resource "aws_route53_record" "shunblog-org-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunblog.org"
      + records         = (known after apply)
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_record.shunkakinoki-com-NS will be created
  + resource "aws_route53_record" "shunkakinoki-com-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunkakinoki.com"
      + records         = (known after apply)
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_record.wiki-shunkakinoki-com-CNAME will be created
  + resource "aws_route53_record" "wiki-shunkakinoki-com-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "wiki.shunkakinoki.com"
      + records         = [
          + "hosting.gitbook.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_record.www-shunblog-org-CNAME will be created
  + resource "aws_route53_record" "www-shunblog-org-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.shunblog.org"
      + records         = [
          + "shunkakinoki.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws-route-53.aws_route53_zone.shunblog will be created
  + resource "aws_route53_zone" "shunblog" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "shunblog.org"
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.aws-route-53.aws_route53_zone.shunkakinoki will be created
  + resource "aws_route53_zone" "shunkakinoki" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "shunkakinoki.com"
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
